FE = 500000;
FN = 0;
k0 = 1;
% a = 6378137;%长半轴 国家2000坐标系
% f = 1 / 298.257222101;%扁率

a = 6378245;%长半轴 北京54坐标系
f = 1 / 298.3;%扁率

e = (2 * f - f * f) ^ 0.5;
ep = ((1 / (1 - f) ^ 2) - 1) ^ 0.5;%参考椭球第二偏心率
B = (22 + 31 / 60 + 54.96727 / 3600) / 180 * pi;%计算点纬度（弧度）
L = (113 + 4 / 60 + 55.00186 / 3600) / 180 * pi;%计算点经度（弧度）
B0 = 0;%原点纬度（弧度）
L0 = 111 / 180 * pi;%中央子午线经度（弧度）

k1 = 1 - e * e / 4 - (3 * e * e * e * e) / 64 - (5 * e * e * e * e * e * e) / 256;
k2 = -(3 * e * e) / 8 - (3 * e * e * e * e) / 32 - (45 * e * e * e * e * e * e)/1024;
k3 = (15 * e * e * e * e) / 256 + (45 * e * e * e * e * e * e)/1024;
k4 = -35 * e * e * e * e * e * e / 3072;

T = tan(B) * tan(B);
C= ep * ep * cos(B) * cos(B);
A = (L - L0) * cos(B);
N = a / ((1 - e * e * sin(B) * sin(B)) ^ 0.5);
M = a * (k1 * B + k2 * sin(2 * B) + k3 * sin(4 * B) + k4 * sin(6 * B));
M0 = a * (k1 * B0 + k2 * sin(2 * B0)+ k3 * sin(4 * B0) + k4 * sin(6 * B0));

X= FN+k0*(M-M0+N*tan(B)*(A*A/2+(5-T+9*C+4*C*C)*A*A*A*A/24)+(61-58*T+T*T+600*C-330*ep*ep)*A*A*A*A*A*A/720)
Y = FE+k0*N*(A+(1-T+C)*A*A*A/6+(5-18*T+T*T+72*C-58*ep*ep)*A*A*A*A*A/120)